###############################################################
#  Generated by:      Cadence Innovus 21.15-s110_1
#  OS:                Linux x86_64(Host ID ece3)
#  Generated on:      Mon Oct 21 14:13:10 2024
#  Design:            cordic_pipeline
#  Command:           routeDesign -globalDetail
###############################################################
current_design cordic_pipeline
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_wire_load_mode enclosed
